@extends('layouts.main')

@section('title', 'سياسة الخصوصية | منصة نادي البرمجة التعليمية')

@section('main')
    <main class="py-5 row">
        <div class="container bg-white shadow rounded p-4 text-right">
            <h4 class="mb-4">سياسة الخصوصية</h4>
        
            <p>نحن في منصة نادي البرمجة نولي أهمية كبيرة لخصوصية مستخدمينا. تهدف هذه السياسة إلى توضيح كيفية جمع بياناتكم واستخدامها وحمايتها.</p>
        
            <h5 class="mt-4">1. جمع البيانات</h5>
            <p>عند التسجيل في المنصة، نقوم بجمع بعض المعلومات الأساسية مثل الاسم وعنوان البريد الإلكتروني التخصص. </p>
        
            <h5 class="mt-4">2. استخدام البيانات</h5>
            <p>نستخدم البيانات التي نجمعها لتحسين تجربتكم التعليمية، وتقديم خدمات مخصصة، وضمان أمان الحسابات، والتواصل معكم بخصوص التحديثات أو الأنشطة الجديدة.</p>
        
            <h5 class="mt-4">3. مشاركة البيانات</h5>
            <p>نحن لا نبيع أو نشارك بياناتكم الشخصية مع أي طرف ثالث دون إذنكم، باستثناء الحالات التي يفرضها القانون أو لحماية حقوق المنصة والمستخدمين.</p>
        
            <h5 class="mt-4">4. أمن المعلومات</h5>
            <p>نعمل على حماية بيانات المستخدمين من خلال تدابير أمان متقدمة.</p>
        
            <h5 class="mt-4">5. ملفات تعريف الارتباط (Cookies)</h5>
            <p>قد نستخدم ملفات تعريف الارتباط لتحسين تجربة المستخدم وتحليل تفاعل الزوار مع المنصة. يمكنكم التحكم في إعدادات المتصفح لإدارة ملفات تعريف الارتباط.</p>
        
            <h5 class="mt-4">6. التعديلات</h5>
            <p>قد نقوم بتحديث سياسة الخصوصية من وقت لآخر، وسيتم إخطار المستخدمين عند حدوث تغييرات جوهرية.</p>
        
            <hr>
            <p>إذا كان لديك أي استفسارات حول سياسة الخصوصية، يرجى التواصل مع اللجنة التقنية بنادي البرمجة.</p>
        </div>
    </main>
@endsection
